In [3]:
# Drop Entry --> lecture 18
import numpy as np 
import pandas as pd
from pandas import Series, DataFrame

In [2]:
ser1 = Series(np.arange(3), index = ['a', 'b', 'c'])

In [3]:
ser1

a    0
b    1
c    2
dtype: int32

In [4]:
ser1.drop('b')

a    0
c    2
dtype: int32

In [6]:
# Make a DataFrame and drop the index row and a column 
dframe1 = DataFrame(np.arange(9).reshape((3,3)),
                    index = ['SF', 'LA', 'NY'],
                    columns= ['pop', 'size','year'])
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [7]:
#dropping a row
dframe1.drop('LA')

    pop  size  year
SF    0     1     2
NY    6     7     8

In [9]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [10]:
# the original dataframe will not be affected. 
# If you want you can create a another df with dropped index

In [11]:
#dropping a column --> use 'axis = 1'
dframe1.drop('year', axis = 1)

    pop  size
SF    0     1
LA    3     4
NY    6     7

In [12]:
# Selecting Entries --> lecture 19

In [13]:
import numpy as np 
import pandas as pd
from pandas import Series, DataFrame

In [18]:
ser1 = Series(np.arange(3), index = ['A', 'B', 'C'])
ser2 = 2*ser1
ser2

A    0
B    2
C    4
dtype: int32

In [19]:
ser2['B']

2

In [20]:
 ser2[1]

2

In [21]:
ser2[0:3]

A    0
B    2
C    4
dtype: int32

In [22]:
ser2[['A', 'B']]

A    0
B    2
dtype: int32

In [23]:
# condition 
ser2[ser2>2]

C    4
dtype: int32

In [24]:
# changing the conditioned row it to other value 
ser2[ser2>2] =10
ser2

A     0
B     2
C    10
dtype: int32

In [30]:
# same operations on dataFrame 
dframe = DataFrame(np.arange(25).reshape((5,5)),
                   index =['SF','LA','NY','DC','DEN'],
                   columns = ['A', 'B', 'C', 'D', 'E'])
dframe

      A   B   C   D   E
SF    0   1   2   3   4
LA    5   6   7   8   9
NY   10  11  12  13  14
DC   15  16  17  18  19
DEN  20  21  22  23  24

In [36]:
# select column and columns
dframe['B']

SF      1
LA      6
NY     11
DC     16
DEN    21
Name: B, dtype: int32

In [35]:
dframe[['B', 'C']]

      B   C
SF    1   2
LA    6   7
NY   11  12
DC   16  17
DEN  21  22

In [38]:
# select columns depending on the condition
dframe[dframe> 10]

        A     B     C     D     E
SF    NaN   NaN   NaN   NaN   NaN
LA    NaN   NaN   NaN   NaN   NaN
NY    NaN  11.0  12.0  13.0  14.0
DC   15.0  16.0  17.0  18.0  19.0
DEN  20.0  21.0  22.0  23.0  24.0

In [39]:
# select by applying condition on a column 
dframe[dframe['C'] > 10]
# check for column C

      A   B   C   D   E
NY   10  11  12  13  14
DC   15  16  17  18  19
DEN  20  21  22  23  24

In [40]:
# boolian return
dframe > 10

         A      B      C      D      E
SF   False  False  False  False  False
LA   False  False  False  False  False
NY   False   True   True   True   True
DC    True   True   True   True   True
DEN   True   True   True   True   True

In [41]:
dframe.ix['LA']
# calling a row via name

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [42]:
dframe.ix[1]
# calling a row via index

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [43]:
# Data Alignment --> lecture 20

In [44]:
import numpy as np 
import pandas as pd
from pandas import Series, DataFrame

In [55]:
ser1 = Series([0,1,2], index = ['A', 'B', 'C'])
ser1

A    0
B    1
C    2
dtype: int64

In [52]:
ser2 = Series([3,4,5,6], index = ['A', 'B', 'C', 'D'])
ser2

TypeError: 'type' object has no attribute '__getitem__'

In [49]:
# let's Add them 
ser1 + ser2
# if the index doesn't match then Null value,even if 'D' index had a value in ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [51]:
dframe = DataFrame(np.arange(4).reshape((2,2)), columns=list('AB'), index = ["NYC", "LA"])
dframe

     A  B
NYC  0  1
LA   2  3

In [56]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)), columns=list('ADC'), index = ["NYC",'SF', "LA"])
dframe1

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [57]:
# Add dataframes of different sizes
dframe+ dframe1

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [60]:
# replace the null value 
dframe.add(dframe1 , fill_value= 0 )
# so before adding the data frame it filling the 0 value and then it adds
# For example LA B was 3 in dframe but in dframe2 theres no b column 
# so it fills 0 for ###dframe1### that and thus we get 3+0 = 3
# SF B is null because in dframe there is no SF so NaN
# fill_zero fills up the second dframe(i.e. dframe1) and not the first(dframe)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [63]:
# operations between dataframe and series
ser3 = dframe1.ix[0]
ser3
# took the first row

A    0
D    1
C    2
Name: NYC, dtype: int32

In [64]:
dframe1 - ser3
# basically subtracting first row from ser3 which is first row itself

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6

In [65]:
# Rank and Sort --> lecture 21
# import numpy as np 
# import pandas as pd
# from pandas import Series, DataFrame

In [67]:
ser1 = Series(np.arange(3), index = ['C', 'A', 'B'])
ser1

C    0
A    1
B    2
dtype: int32

In [69]:
ser1.sort_index()
# sorting sort via index

A    1
B    2
C    0
dtype: int32

In [74]:
ser1.order()
# order by values

C:\Users\Jai Katariya\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

C    0
A    1
B    2
dtype: int32

In [1]:
from numpy.random import randn

In [5]:
ser2 = Series(randn(10))

ser2

0   -1.496859
1    0.221900
2   -2.373054
3   -0.170485
4   -0.901737
5   -0.841973
6    0.026322
7   -1.132466
8    0.375688
9   -0.501791
dtype: float64

In [7]:
ser2.sort()
ser2
# sorted from lowest to highest

C:\Users\Jai Katariya\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: sort is deprecated, use sort_values(inplace=True) for INPLACE sorting
  if __name__ == '__main__':

2   -2.373054
0   -1.496859
7   -1.132466
4   -0.901737
5   -0.841973
9   -0.501791
3   -0.170485
6    0.026322
1    0.221900
8    0.375688
dtype: float64

In [9]:
# Rank 
ser2.rank()
# rank is in order as we ranked a sorted data

2     1.0
0     2.0
7     3.0
4     4.0
5     5.0
9     6.0
3     7.0
6     8.0
1     9.0
8    10.0
dtype: float64

In [11]:
# let's rank first 
ser3 = Series(randn(10))
ser3

0   -0.951181
1   -0.549136
2    0.497095
3    0.228639
4   -1.393581
5    0.027619
6    0.163205
7   -1.453904
8   -0.071302
9    1.150658
dtype: float64

In [12]:
ser3.rank()
# here the index are in line but not the rank

0     3.0
1     4.0
2     9.0
3     8.0
4     2.0
5     6.0
6     7.0
7     1.0
8     5.0
9    10.0
dtype: float64

In [17]:
ser3.sort()
ser3

C:\Users\Jai Katariya\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: sort is deprecated, use sort_values(inplace=True) for INPLACE sorting
  if __name__ == '__main__':

7   -1.453904
4   -1.393581
0   -0.951181
1   -0.549136
8   -0.071302
5    0.027619
6    0.163205
3    0.228639
2    0.497095
9    1.150658
dtype: float64

# Missing Data - lecture 23

In [19]:
import pandas as pd

In [20]:
data = Series([ 'one', 'two', np.nan, 'four'])

In [21]:
data

0     one
1     two
2     NaN
3    four
dtype: object

In [22]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [23]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [25]:
dframe = DataFrame([[1,2,3],[np.nan, 5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [27]:
clean_dframe = dframe.dropna()
clean_dframe
# this drops all rows if they have one null

     0    1    2
0  1.0  2.0  3.0

In [28]:
dframe.dropna(how = 'all')
# dropping rows where all are null

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [29]:
dframe.dropna(axis = 1)
# dropping columns with null

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [31]:
npn = np.nan

dframe2 = DataFrame([[1,2,3,npn], [2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [32]:
dframe2.dropna(thresh= 2)
# thresh is 2 means atleast 2 values

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [36]:
dframe2.dropna(thresh= 3)
# thresh is 3 means atleast 3 values

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [37]:
dframe2.fillna(1)
#fill the na value with 1

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [39]:
dframe2.fillna(6, axis= 1)
# for columns filling

     0    1    2    3
0  1.0  2.0  3.0  6.0
1  2.0  6.0  5.0  6.0
2  6.0  7.0  6.0  9.0
3  1.0  6.0  6.0  6.0

In [41]:
dframe2.fillna({0:10, 1:100, 2:200, 3:300})
# fill column wise and specific value

      0      1      2      3
0   1.0    2.0    3.0  300.0
1   2.0  100.0    5.0    6.0
2  10.0    7.0  200.0    9.0
3   1.0  100.0  200.0  300.0

In [43]:
dframe2.fillna({0:10, 1:100, 2:200, 3:300}, inplace=True)
# permanently changing the data

      0      1      2      3
0   1.0    2.0    3.0  300.0
1   2.0  100.0    5.0    6.0
2  10.0    7.0  200.0    9.0
3   1.0  100.0  200.0  300.0

In [44]:
dframe2

      0      1      2      3
0   1.0    2.0    3.0  300.0
1   2.0  100.0    5.0    6.0
2  10.0    7.0  200.0    9.0
3   1.0  100.0  200.0  300.0